app/controllers/contacts_controller.rb

  def create
    if params[:cros]!='y'
      #create from page query. @xieyinghua
      @contact = Contact.new(contact_params)
    else
      #create from cros post. @xieyinghua
      new_contact_params=Hash.new
      new_contact_params[:name]=params[:name]
      new_contact_params[:phone]=params[:phone]
      new_contact_params[:reason]=params[:reason]
      new_contact_params[:email]=params[:email]

      @contact=Contact.new(new_contact_params)
    end

    respond_to do |format|
      if @contact.save
---
INSERT INTO "contacts" ("name", "phone", "reason", "email", "created_at", "updated_at") VALUES ('測試王', '0911111111', '留言的原因很簡單', 'test_wang@king.com', '2019-04-29 08:29:30.399000', '2019-04-29 08:29:30.399000') RETURNING ("id")