app/controllers/faqs_controller.rb

  def index
    @faqs = Faq.all
---
SELECT "faqs".* FROM "faqs"

  def create
    if params[:cros]!='y'
      #create from page query. @xieyinghua
      @faq = Faq.new(faq_params)
    else
      #create from cros post. @xieyinghua
      new_faq_params=Hash.new
      new_faq_params[:question]=params[:question]
      new_faq_params[:answer]=params[:answer]

      @faq=Faq.new(new_faq_params)
    end

    respond_to do |format|
      if @faq.save
---
INSERT INTO "faqs" ("question", "answer", "created_at", "updated_at") VALUES ('問題一', '回答一', '2019-04-29 08:30:26.468000', '2019-04-29 08:30:26.468000') RETURNING ("id")

    def set_faq
      @faq = Faq.find(params[:id])
---
SELECT  "faqs".* FROM "faqs" WHERE "faqs"."id" = 1 LIMIT 1