app/controllers/news_controller.rb

  def index
    @news = News.all
---
SELECT "news".* FROM "news"

  def create
    if params[:cros]!='y'
      #create from page query. @xieyinghua
      @news = News.new(news_params)
    else
      #create from cros post. @xieyinghua
      new_news_params=News.new
      new_news_params[:postdate]=params[:postdate]
      new_news_params[:posttime]=params[:posttime]
      new_news_params[:title]=params[:title]
      new_news_params[:body]=params[:body]
      new_news_params[:picture]=params[:picture]

      @new=News.new(new_news_params)
    end

    respond_to do |format|
      if @news.save
---
INSERT INTO "news" ("title", "body", "picture", "postdate", "posttime", "created_at", "updated_at") VALUES ('測試標題', '測試內容', '', '2019-04-29', '2019-04-29 16:28:00.000000', '2019-04-29 08:28:26.398000', '2019-04-29 08:28:26.398000') RETURNING ("id")

  def destroy
    if params[:cros]=='y'
      #create from cros post. @xieyinghua
      id=params[:id]
      @news=News.where("id='#{id}'").first
    end

    @news.destroy
---
SELECT  "news".* FROM "news" WHERE "news"."id" = 4 LIMIT 1
DELETE FROM "news" WHERE "news"."id" = 4

    def set_news
      @news = News.find(params[:id])
---
SELECT  "news".* FROM "news" WHERE "news"."id" = 1 LIMIT 1